In [1]:
#Libraries 
import sqlite3
import pandas as pd

#connection with db
conn = sqlite3.connect("ladder.db")

In [2]:
# 32) How many rows are in the `pets` table?

sql= '''SELECT count(*) 
        FROM pets;'''
pd.read_sql(sql,conn)

   count(*)
0        13

In [11]:
#34) How many female cats are in the `pets` table?

sql='''SELECT count(*) 
        FROM pets 
        WHERE sex = 'F' AND species='cat';'''
pd.read_sql(sql,conn)

   count(*)
0         4

In [14]:
#35) What's the mean age of pets in the `pets` table?

sql = '''SELECT AVG(age) 
        FROM pets;'''
pd.read_sql(sql,conn)

   AVG(age)
0  5.230769

In [18]:
#36) What's the mean age of dogs in the `pets` table?

sql='''SELECT AVG(age) 
        FROM pets 
        WHERE species = 'dog';'''

pd.read_sql(sql,conn)

   AVG(age)
0       6.5

In [22]:
# 37) What's the mean age of male dogs in the `pets` table?

sql= '''SELECT AVG(age) 
        FROM pets 
        WHERE sex='M' AND species = 'dog';'''

pd.read_sql(sql,conn)

   AVG(age)
0  8.333333

In [23]:
# 38) What's the count, mean, minimum, and maximum of pet ages in the `pets` table?

sql = '''SELECT COUNT(age), AVG(age), MIN(age), MAX(age) 
        FROM pets;'''

pd.read_sql(sql,conn)

   COUNT(age)  AVG(age)  MIN(age)  MAX(age)
0          13  5.230769         1        10

In [34]:
# 39) Repeat the previous problem with the following stipulations:
    #* Round the average to one decimal place.
    #* Give each column a human-readable column name (for example, "Average Age")
    
sql = '''SELECT COUNT(age) as Number_Rows, ROUND(AVG(age)) as Average_Age,MIN(age) as Minimum_Age,MAX(age) as Maximun_Age
        FROM pets;'''

pd.read_sql(sql,conn)

   Number_Rows  Average_Age  Minimum_Age  Maximun_Age
0           13          5.0            1           10

In [50]:
# 40) How many rows in `employees_null` have missing salaries?

sql = '''SELECT COUNT(*) 
        FROM employees_null
        WHERE salary is null;'''

pd.read_sql(sql,conn)

   COUNT(*)
0        10

In [57]:
# 41) How many salespeople in `employees_null` having _nonmissing_ salaries?

sql = '''SELECT COUNT(job) 
        FROM employees_null
        WHERE job= 'Sales' AND salary is null;'''

pd.read_sql(sql,conn)

   COUNT(job)
0           8

In [62]:
# 42) What's the mean salary of employees who joined the company after 2010? Go back to the usual `employees` table for this one.
#     * _Hint:_ You may need to use the `CAST()` function for this. To cast a string as a float, you can do `CAST(x AS REAL)`

sql=''' SELECT CAST(AVG(salary) AS REAL) 
        FROM employees
        WHERE startdate > 2010;'''

pd.read_sql(sql,conn)

   CAST(AVG(salary) AS REAL)
0                    79814.6

In [65]:
# 43) What's the mean salary of employees in Swiss Francs?
#     * _Hint:_ Swiss Francs are abbreviated "CHF" and 1 USD = 0.97 CHF.

sql ='''SELECT avg(salary_CHF) as average_salry_CHF
        FROM( select *,(salary*0.97)as salary_CHF FROM employees)as a'''
pd.read_sql(sql,conn)

   average_salry_CHF
0         75727.5605

In [68]:
sql ='''SELECT avg(salary*0.97) from employees;'''
pd.read_sql(sql,conn)

   avg(salary*0.97)
0        75727.5605

    ID    firstname  lastname            job  salary   startdate
0    0    Christine  Thompson          Sales  123696  2005-01-20
1    1       Thomas      Peck          Sales  112972  2011-01-04
2    2  Christopher    Robles             IT   78426  2003-12-10
3    3    Elizabeth     Munoz          Sales   55824  1993-07-28
4    4       Janice    Martin             IT   62007  2011-02-25
..  ..          ...       ...            ...     ...         ...
95  95         Tina     Flynn     Operations   55916  2006-01-19
96  96        Allen     Cross          Sales  118571  2019-05-10
97  97     Brittany   Maynard          Sales   69257  2003-02-03
98  98      Bradley    Romero  Administrator   45264  2009-05-10
99  99        Jacob    Baxter          Sales   74536  2012-10-24

[100 rows x 6 columns]

In [95]:
# 44) Create a query that computes the mean salary in USD as well as CHF. Give the columns human-readable names (for example "Mean Salary in USD"). Also, format them with comma delimiters and currency symbols.
#     * _NOTE:_ Comma-delimiting numbers is only available for integers in SQLite, so rounding (down) to the nearest dollar or franc will be done for us.
#     * _NOTE2:_ The symbols for francs is simply `Fr.` or `fr.`. So an example output will look like `100,000 Fr.`.
sql= '''SELECT printf('$%,.2d',AVG(salary))as Mean_Salary_USD,printf('%,.2d%s',AVG(salary*0.97),' Fr.') as Mean_salary_CHF 
        FROM employees;'''

pd.read_sql(sql,conn)

  Mean_Salary_USD Mean_salary_CHF
0         $78,069      75,727 Fr.

In [69]:
sql= '''SELECT * 
        FROM employees;'''
pd.read_sql(sql,conn)

    ID    firstname  lastname            job  salary   startdate
0    0    Christine  Thompson          Sales  123696  2005-01-20
1    1       Thomas      Peck          Sales  112972  2011-01-04
2    2  Christopher    Robles             IT   78426  2003-12-10
3    3    Elizabeth     Munoz          Sales   55824  1993-07-28
4    4       Janice    Martin             IT   62007  2011-02-25
..  ..          ...       ...            ...     ...         ...
95  95         Tina     Flynn     Operations   55916  2006-01-19
96  96        Allen     Cross          Sales  118571  2019-05-10
97  97     Brittany   Maynard          Sales   69257  2003-02-03
98  98      Bradley    Romero  Administrator   45264  2009-05-10
99  99        Jacob    Baxter          Sales   74536  2012-10-24

[100 rows x 6 columns]